# OnOKAction Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TabbedDialogExtension..::..OnOKAction Property
TabbedDialogExtension Class See Also
---
The ok handler.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public TabbedDialogAction OnOKAction { get; }
```

Visual Basic
---
```text
Public ReadOnly Property OnOKAction As TabbedDialogAction
	Get
```

Visual C++
---
```text
public:
property TabbedDialogAction^ OnOKAction {
	TabbedDialogAction^ get ();
}
```

# Remarks
This handler will be invoked when the "Ok" button in Revit options dialog is clicked.
# See Also
TabbedDialogExtension Class
Autodesk.Revit.UI Namespace